"Bass Frequency" = "Bassfrequenz"; 
"Bass Gain" = "Basspegel"; 
"Low Mid Frequency" = "Untere Mittenfrequenz";
"Low Mid Gain" = "Unterer Mittenpegel";
"High Mid Frequency" = "Obere Mittenfrequenz";
"High Mid Gain" = "Oberer Mittenpegel";
"Treble Frequency" = "Höhenfrequenz";
"Treble Gain" = "Höhenpegel";
